{
  "title": {
    "media": {
      "url": "",
      "caption": "",
      "credit": ""
    },
    "text": {
      "headline": "Projekte",
      "text": ""
    }
  },
  "events": [
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "10",
        "day": "1",
        "year": "1999"
      },
      "end_date": {
        "month": "3",
        "day": "1",
        "year": "2000"
      },
      "text": {
        "headline": "TT-SIB 4",
        "role": "Entwickler",
        "text": "Mitarbeit an der Weiterentwicklung der TT-SIB, Projekt : Umsetzung der Ereignis bezogenen Fortführung (EBFF, im Team mit 3 Entwicklern, Centura SqlWindows und Datenbankprogrammierung und Oracle, Microsoft SqlServer und SqlBase)"
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "3",
        "day": "1",
        "year": "2000"
      },
      "end_date": {
        "month": "6",
        "day": "1",
        "year": "2000"
      },
      "text": {
        "headline": "TT-Budget DVB",
        "role": "Entwickler",
        "text": "Programmierung eines Direct Show Filters zum Live Abspielen von DVB Programmen (Integration eines Softwaredecoders für digitales Fernsehen über Satellit), Windows Programmierung mit Microsoft Visual C++ 6.0."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "6",
        "day": "1",
        "year": "2000"
      },
      "end_date": {
        "month": "4",
        "day": "9",
        "year": "2002"
      },
      "text": {
        "headline": "TT-SIB Online",
        "role": "Entwickler",
        "text": "Entwicklung eines Java basierten Informationssystems für die TT-SIB, Oberfläche basierend auf Java Server Pages, MapInfo MapXtreme für Java, daneben verschiedene kleinere Centura SqlWindows Projekte."
      }
    },
    {
      "media": {
        "url": "https://www.doag.org/formes/servlet/DocNavi?action=getFile&did=48451&file=isgsn_doag_sig_intermedia_200402.pdf",
        "caption": "",
        "credit": "www.robotron.de"
      },
      "start_date": {
        "month": "4",
        "day": "9",
        "year": "2002"
      },
      "end_date": {
        "month": "5",
        "day": "9",
        "year": "2003"
      },
      "text": {
        "headline": "ISGSN",
        "role": "Entwickler",
        "text": "Informationssystem Gesamtstraßennetz Sachsen. Java basiertes Informationssystem auf Grundlage einer Oracle Datenbank (mit Spatial), EJB und Open GIS Webservices (WFS / WMS, Server und Client)."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "5",
        "day": "9",
        "year": "2003"
      },
      "end_date": {
        "month": "6",
        "day": "1",
        "year": "2004"
      },
      "text": {
        "headline": "TT-SIB INFOSYS",
        "role": "Entwickler",
        "text": "Auskunftssystem für die TT-SIB, Open GIS Web Services, Smart Client basierend auf Java Webstart, Apache Tomcat, XSL:FO (cocoon, PDF Erzeugung), Apache Axis (SOAP Server/Client), OKSTRA-XML Schnittstelle."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "6",
        "day": "1",
        "year": "2004"
      },
      "end_date": {
        "month": "12",
        "day": "31",
        "year": "2004"
      },
      "text": {
        "headline": "NOVALAST (Thüringen)",
        "role": "Entwickler",
        "text": "NOVALAST, Java Webstart basierte Anwendung zur Schwerlasttransportplanung. NOVALAST ermöglicht die fachliche Prüfung von Großraum- und Schwerlasttransporten. Die Grundlage hierfür bildet eine interaktive Karte auf Basis des Straßennetzes einer Straßeninformationsbank. Mit der Umsetzung des Projektes konnte ich erstmals aufzeigen, dass eine Straßeninformationsbank routingfähig ist. Die Grundlage hierfür ist die Definition der verbotenen Fahrbeziehungen, wie sie auch in den Telematiknetzen (GDF Standard) definiert werden."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "1",
        "day": "1",
        "year": "2005"
      },
      "end_date": {
        "month": "5",
        "day": "1",
        "year": "2005"
      },
      "text": {
        "headline": "NOVALAST (Brandenburg)",
        "role": "Entwickler",
        "text": "Weiterentwicklung NOVALAST, Anpassung für das Land Brandenburg (Fox Pro + DFÜ)."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "5",
        "day": "1",
        "year": "2005"
      },
      "end_date": {
        "month": "5",
        "day": "1",
        "year": "2007"
      },
      "text": {
        "headline": "TT-SIB 5 und ASB 2005 (Netz, Bestand)",
        "role": [ "Entwickler", "Architekt" ],
        "text": "Mit der Umsetzung des Projektes wurde die TT-SIB auf eine Mehrschichtenarchitektur umgestellt und gleichzeitig an die aktuellen Regelwerke angepasst. Die bislang ausschließlich im Client und in der Datenbank enthaltene Fachlogik wurde als eigenständige Dienste bereitgestellt. Ich konnte die Architektur des Gesamtsystems entwerfen und auch maßgeblich zur Umsetzung beitragen. Die wesentlichen Technologien waren Java EE (z.B. Servlets, JAXB), Spring Framework, Hibernate, SOAP. Als Laufzeitumgebung wurde der Apache Tomcat verwendet."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "5",
        "day": "1",
        "year": "2007"
      },
      "end_date": {
        "month": "3",
        "day": "1",
        "year": "2008"
      },
      "text": {
        "headline": "XVemags Unterstützung für NOVALAST",
        "role": ["Entwickler", "Projektleiter"],
        "text": "Im Rahmen des Projektes wurde die XVemags Schnittstelle für NOVALAST realisiert. VEMAGS ist das bundesweite Verfahrensmanagement für Großraum- und Schwerlasttransporte (http://www.vemags.de). Zur Anbindung von Drittsystemen wird eine OSCI Tranport basierende Schnittstelle (XVemags) angeboten. Die Pflege des Standards erfolgt über die Koordinierungsstelle für IT-Standards (KoSIT) als 'XML Standard in der öffentlichen Verwaltung' (XÖV). NOVALAST war das erste Drittsystem für die fachliche Prüfung. Die Lösung konnte ich am Stand der Hessischen Straßenbauverwaltung (heute Hessen Mobil) auf der Cebit präsentiert."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "2",
        "day": "1",
        "year": "2008"
      },
      "end_date": {
        "month": "5",
        "day": "1",
        "year": "2009"
      },
      "text": {
        "headline": "TT-SIB LRVN (Landesradverkehrsnetz)",
        "role": ["Projektleiter"],
        "text": ["Umsetzung des RCP Clients für das Landesradverkehrsnetz Sachsen-Anhalts. Aufgabe war die Umsetzung der Masken für die alphanumerische Darstellung und Pflege der Bestandsdaten für das Radwegenetz. Zusätzlich erfolgte die Integration einer interaktiven Karte und von verschiedenen Auswertungen. Grundlage dafür bildeten die Webdienste der TT-SIB 5. Meine Aufgabe war die Leitung des fünfköpfigen Projektteams und der Entwurf der Architektur des Gesamtsystems.",
          "Das Projekt war ein Teilprojekt für die Entwicklung des Landesradverkehrsplans in Sachsen-Anhalt."]
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "6",
        "day": "1",
        "year": "2010"
      },
      "end_date": {
        "month": "5",
        "day": "1",
        "year": "2011"
      },
      "text": {
        "headline": "Anpassung von NOVALAST an die neue RGST und den VEMAGS Statik Rechenkern",
        "role": ["Projektleiter"],
        "text": [ "Grundlage für den Genehmigungsprozess für Großraum- und Schwerlasttransporte sind u.a. die RGST 92 und die DIN 1072. Diese Regelwerke waren auch die fachliche Basis für die Entwicklung von NOVALAST. Im Rahmen des Projektes wurde die Unterstützung der aktualisierten Regelwerke (DIN FB 101, RGST 2013) und die Anbindung eines neuen Rechenkerns zur statischen Prüfung von Brückenbauwerken (VEMAGS Statik) realisiert. Ich konnte als Projektleiter in Absprache mit den Experten die Pflichtenhefte erstellen und in der Realisierungsphase das Projektteam unterstützen.",
          "Die fachliche Umsetzung erfolgte in enger Zusammenarbeit mit dem damaligen Leiter der Fachgruppe VEMAGS Statik. Die Ergebnisse haben wir im Rahmen des 5. OKSTRA Symposiums gemeinsam vorgestellt." ]
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "2",
        "day": "14",
        "year": "2011"
      },
      "end_date": {
        "month": "5",
        "day": "1",
        "year": "2014"
      },
      "text": {
        "headline": "Realisierung des OKSTRA WFS (OkWS) für das BMVI",
        "role": ["Projektleiter"],
        "text": "Durch das Bundesministerium für Verkehr (BMVBS bzw. jetzt BMVI) wurde die Realisierung eines Web Feature Service (WFS) für das OKSTRA Datenschema beauftragt. NOVASIB beteiligte sich als Unterauftragnehmer an dem Projekt. Meine Aufgabe war die Leitung des Projektteams bei NOVASIB. Hier konnten wir die Umsetzung der OKSTRA Schnittstelle auf Grundlage der OKSTRA Klassenbibliothek (OKLABI) und die Anbindung der TT-SIB realisieren."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "5",
        "day": "3",
        "year": "2012"
      },
      "end_date": {
        "month": "12",
        "day": "31",
        "year": "2014"
      },
      "text": {
        "headline": "NOVATRANS",
        "role": ["Projektleiter"],
        "text": "Im Rahmen dieses Projektes wurde eine Spezialsoftware zur Unterstützung der internen Prozesse bei der GENOSK (http://www.genosk.de/) realisiert. Die Umsetzung erfolgte durch ein externes Entwicklerteam im europäischen Ausland (4 Personen). Ich habe mich um die Projektsteuerung und die Analyse und Dokumentation der fachlichen Anforderungen des Kunden gekümmert."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "10",
        "day": "17",
        "year": "2013"
      },
      "end_date": {
        "month": "11",
        "day": "30",
        "year": "2014"
      },
      "text": {
        "headline": "Forschungsprojekt Integriertes Straßeninformationssystem (2013 FE 0099)",
        "role": ["Projektleiter"],
        "text": "Dieses mit Mitteln des Europäischen Fonds für regionale Entwicklung (EFRE) geförderte Forschungsprojekt hat ein Team von 9 Mitarbeitern zusammen mit mir als Projektleiter umgesetzt. Thema war die Realisierung einer neuartigen Oberfläche für die systemunabhängige Verfügbarkeit der Bestandsdaten innerhalb der Straßeninformationsbank. Das Projekt zeigte auf, wie die Bestandsdaten des überörtlichen Verkehrs in einer modernen Weboberfläche präsentiert und fortgeschrieben werden können. Durch die Verknüpfung der verschiedenen Fachinformationssysteme durch Ausnutzung verschiedener Webtechnologien wird eine verbesserte strategische Planung und ein effizienterer Betrieb der Straßen des überörtlichen Verkehrs erreicht. Die Ergebnisse des Projektes konnte ich im Rahmen des 6. OKSTRA Symposiums am 21.05.2015 einem Fachpublikum präsentieren."
      }
    },
    {
      "media": {
        "url": "",
        "caption": "",
        "credit": ""
      },
      "start_date": {
        "month": "1",
        "day": "1",
        "year": "2013"
      },
      "text": {
        "headline": "TT-SIB INFOSYS 8",
        "role": ["Entwickler", "Architekt", "Projektleiter"],
        "text": [
          "Mit INFOSYS 8 wirke ich an der Realisierung eines neuen WebClients auf Basis der TT-SIB 5 mit. Die technologische Umsetzung erfolgt auf Basis der Eclipse RAP Plattform und damit als OSGI Module. Zur Laufzeit wird Equinox verwendet.",
          "Teile der Anwendung werden nativ in HTML 5 / Javascript realisiert. Dazu gehört z.B. die interaktive Karte auf Basis von Openlayers und die schematische Darstellung von Straßendaten mit SVG. ",
          "Ich arbeite maßgeblich am Entwurf der Architektur mit und unterstütze das sechsköpfige Entwicklerteam bei der Realisierung. Für Teilprojekte helfe ich als Projektleiter dem Projektteam bei der Realisierung."
        ]
      }
    }
  ]
}